import * as materials from "./materials";

const ganyu_detail = {
  name: "감우",
  summary:
    "얼음과 활을 사용하는 메인 딜러.\n<em>감우</em>는 리월 월해정 소속으로, <em>응광</em>의 비서를 맡고 있다. 계획적이면서도 한 번 일을 시작하면 거의 쉬지도 않아 근면성실하다 못해, <em>감우</em>가 없으면 업무가 마비될 정도이다. 야근도 거의 매일 한다.\n혹사에 가까울 정도로 일에 매진하지만, 그럼에도 버틸 수 있는 이유는, <em>감우</em>는 선인인 '기린'과의 혼혈이기 때문이다. 사실 <em>감우</em>는 <em>리월</em>이라는 도시가 탄생할 때부터 활동하고 있었고, <em>암왕제군</em>의 충신이었는데, <em>암왕제군</em>의 지시로 <em>리월 칠성</em>의 비서일을 시작했던 것이다.\n<em>감우</em>는 스스로 오랜 세월을 살아온 선인이라 그런지, 인간사회에 적응하지 못했다. 그렇기에 더더욱 일에만 매진하고 인간 친구가 별로 없었는데, 인간계에서 오랫동안 생활한 데다 스스로 혼혈이라는 생각에 선인계에도 섞이지 못했다. 하지만 산에서 선인 수행을 하던 <em>감우</em>를 찾아온 <em>여행자</em>와의 짧은 여행에서, 자신이 리월에서 어떤 사람이었는지를 깨닫게 된다. 동료뿐 아니라 칠성의 회장까지 <em>감우</em>를 존경하고 신뢰하고 있다는 것을 안 <em>감우</em>는, 결국 인간계로 복귀하게 된다.\n<em>감우</em>는 어렸을 적부터 <em>류운차풍진군</em>의 제자, 사실상 의붓딸처럼 함께 지냈다. <em>류운차풍진군</em>은 <em>감우</em>의 어린 시절을 상세히 알았는데, 문제는 <em>류운차풍진군</em>이 수다를 좋아한다는 것이다. <em>감우</em>의 짧은 여행중, <em>여행자</em>에게 <em>감우</em>의 어린시절을 주절주절 얘기해버리기도 했다.\n기린은 채식주의이지만, <em>감우</em>의 어린 시절은 데굴데굴 굴러다닐 정도로 비만이었다고 한다. (코끼리도 채식주의..) 현재도 식탐이 많아 <em>리월</em> 최고의 식당중 하나인 <em>만민당</em> 근처를 지나는 것도 조심한다고 한다. 검은색 뿔을 가지고 있는데, 굉장히 예민하다고 한다(!). 점심 식사 후에는 꼭 낮잠을 자는데, 한번 잠들면 잘 깨지 않는다. 하루는 점심 식사 후 볏짚에서 낮잠을 잤는데, 거기가 하필 마차 위라 마부가 그대로 운전해 볏짚을 옮기는 바람에 실종되는 사고도 있었다. 이후에는 잘 자리를 조심히 고르게 되었다고 한다.\n<em>류운차풍진군</em>에게 <em>신학</em>이라는 또다른 제자가 있는데, 본래는 인간이기에 인간 세계에 돌아가는 것이 옳다고 본 <em>류운차풍진군</em>은 <em>신학</em>을 인간 세계에 보냈고, <em>감우</em>는 선배이자 언니로써 <em>신학</em>이 인간 세계에 잘 적응하도록 도와주고 있다. 여담으로 <em>신학</em>은 코난의 유미란, <em>감우</em>는 코난의 코난 역을 했던 성우가 맡았다.\n<em>암왕제군</em>과는 마신 전쟁때부터 함께했다. 선인들 중에서는 어린 편이지만, <em>암왕제군</em>의 명에 따라 <em>리월</em>이 만들어지고 인간이 사회를 만들 수 있게 도우라는 명에 따라 인간 세계에 남은 충신이었다. 또한 현재는 신분을 바꾼 <em>암왕제군</em>을 바로 알아본것으로 보인다.\n미소녀인데다 검은색 바디스타킹 + 하이레그 + 흰색 천 포인트로 상당히 과감한 패션을 자랑한다. 뿐만아니라 푸른 머리 미소녀 + 오피스 레이디(OL) + 목에 맨 워낭 + 수면부족 + 검은 뿔 + 식탐으로 모에 요소가 몰빵되어있어 인기가 상당히 많다. 초창기 원신이 널리 알려지게 된 공신 중 하나.\n<em>치치</em>가 야자 우유를 야자 염소에게서 구해다 달라고 했었는데, <em>감우</em>가 뿔이 달려있어서 그런지 야자염소라는 별명을 얻게 되었다. 여담으로 <em>블루 아카이브</em>의 <em>아마우 아코</em>와 (성격 제외) 매우 닮았다. <em>아코</em>의 성 아마우(甘雨)도 같은 한자를 쓴다.\n활 강공격(조준 공격)을 사용하는 최초의 딜러였는데, 이때문에 예뻐서 뽑아놓고 조작감이 불편해 쓰지 않는 사람도 많았다.",
  profile: {
    en_name: "Ganyu",
    gender: "여성",
    rareness: "★★★★★",
    element: "얼음",
    weapon: "활",
    constellation: "선린",
    birthday: "12/02",
    union: "리월 - 월해정",
    actor: ["김선혜", "上田 麗奈(우에다 레이나)", "Jennifer Losi", "林簌"],
    cook: {
      name: "태평성대",
      content:
        "'세계 평화' 제작 시 획득 가능.\n선택한 캐릭터 HP 최대치의 40%를 회복하고 추가로 HP를 2350pt 회복한다.\n감우의 특제 요리. 기린이 꽃밭에서 쉬는 모습을 바라보기만 해도 마음이 차분해진다. 감우는 소중히 여기는 여행자에게 세상이 아름답길 바라는 마음을 담아 만든 요리와 자신이 제일 좋아하는 청심화를 남겼다.",
    },
    materials: {
      penetration: [
        materials.geos,
        "현암의 탑",
        "세실리아 꽃",
        materials.chuchu_scroll,
      ],
      skills: [
        materials.quotes,
        "하늘을 삼킨 고래",
        materials.chuchu_scroll,
        "지식의 왕관",
      ],
    },
  },
  skills: {
    normal_attack: {
      name: "페보니우스 검술 · 백",
      content:
        "일반 공격 : 검으로 최대 5번 공격한다.\n강공격 : 일정 스태미너를 소모해 순간적으로 전방을 향해 검을 2번 휘두른다.",
    },
    normal_skill: {
      name: "창생법 · 모조 태양꽃",
      content: "<em>태양꽃</em>을 생성해 바위 원소 범위 피해를 준다.",
      sub_content: [
        {
          name: "태양꽃",
          content:
            "<em>태양꽃</em>은 다음 특성을 가진다.\n· <em>태양꽃</em>을 중심으로 한 영역에서 적이 피해를 받으면 <em>태양꽃</em>은 <em>찰나의 꽃</em>을 피워 바위 원소 범위피해를 주며, 해당 피해는 <em>알베도</em>의 방어력의 영향을 받는다.\n· <em>찰나의 꽃</em>은 2초마다 1번만 생성된다.\n· 캐릭터가 <em>태양꽃</em> 위에 있을 때, <em>태양꽃</em>은 바위 원소의 힘을 모아 캐릭터를 일정 높이까지 들어 올리는 <em>크리스탈 플랫폼</em>을 만든다. <em>크리스탈 플랫폼</em>은 동시에 1개만 존재할 수 있다.\n· <em>알베도</em>가 만들어 낸 <em>태양꽃</em>은 동시에 1개만 존재할 수 있으며, 바위 원소 창조물로 간주한다.",
        },
        {
          name: "홀드",
          content: "<em>태양꽃</em>이 생성되는 위치를 조정할 수 있다.",
        },
      ],
      comment:
        "이러한 바위 꽃은 연금술의 목적과 일치하는 독특한 특징을 가지고 있다. 대지에서 태어났지만, 하늘 높이 올라가서 태양이 되고 싶어 한다.",
    },
    dash_skill: {
      name: "",
      content: "",
      comment: "",
    },
    ultimate_skill: {
      name: "탄생식 · 대지의 파동",
      content:
        "바위 수정은 <em>알베도</em>의 지시에 따라 폭발해 <em>알베도</em> 전방에 바위 원소 범위 피해를 준다.\n필드 위에 <em>알베도</em>가 만든 <em>태양꽃</em>이 존재할 때, <em>태양꽃</em> 영역 안에 <em>생멸의 꽃</em> 7송이가 맹렬하게 피어나면서 바위 원소 범위 피해를 준다. 폭발 피해와 <em>생멸의 꽃</em> 피해는 <em>찰나의 꽃</em>을 만들어 낼 수 없다.",
      sub_content: [
        {
          name: "",
          content: "",
        },
      ],
      comment: "백악색 왕자의 명령에 따라, 대지의 창조물이 용솟음 친다.",
    },
    break_skills: {
      first: {
        name: "백악색의 위압",
        content:
          "<em>창생법 · 모조 태양꽃</em>의 <em>찰나의 꽃</em>이 HP가 50% 미만인 적에게 가하는 피해가 25% 증가한다.",
      },
      fourth: {
        name: "병 속 인간의 지혜",
        content:
          "<em>탄생식 · 대지의 파동</em> 발동 시 주변의 파티 내 캐릭터의 원소 마스터리가 125pt 증가한다. (지속시간 : 10초)",
      },
    },
    inherence_skills: [
      {
        name: "천재의 발견",
        content:
          "무기 돌파 소재를 합성 시 10%의 확률로 생산량의 2배를 획득한다.",
      },
    ],
    constellation: [
      {
        name: "에덴의 꽃",
        content:
          "<em>알베도</em>의 <em>창생법 · 모조 태양꽃</em>으로 생성된 <em>찰나의 꽃</em>이 피어날 때, <em>알베도</em> 자신의 원소 에너지가 1.2pt 회복된다.",
      },
      {
        name: "현생의 누대",
        content:
          "<em>창생법 · 모조 태양꽃</em>의 <em>찰나의 꽃</em>이 피어날 때 <em>알베도</em>에게 <em>생멸 카운트</em> 효과를 부여한다. (지속시간 : 30초)\n · <em>탄생식 · 대지의 파동</em>을 발동하면 모든 <em>생멸 카운트</em> 효과를 지우고, 지운 스택이 많을수록 <em>탄생식 · 대지의 파동</em>의 폭발 피해와 <em>생멸의 꽃</em>으로 가하는 피해가 증가한다.\n · <em>생멸 카운트</em>가 1 스택 쌓일 때마다 피해가 <em>알베도</em> 방어력의 30%만큼 증가한다.\n · 최대 중첩 수 : 4회",
      },
      {
        name: "태양의 꽃",
        content: "<em>창생법 · 모조 태양꽃</em> 스킬 레벨+3 (최대 Lv.15)",
      },
      {
        name: "신성의 추락",
        content:
          "<em>태양꽃</em> 범위 안에 있는 현재 필드 위 캐릭터의 낙하 공격 피해가 30% 증가한다.",
      },
      {
        name: "명왕누대의 파동",
        content: "<em>탄생식 · 대지의 파동</em> 스킬 레벨+3 (최대 Lv.15)",
      },
      {
        name: "무구의 흙",
        content:
          "<em>태양꽃</em> 범위 안에 있는 현재 필드 위 캐릭터가 결정 반응로 생성된 방패의 보호를 받고 있을 때, 가하는 피해가 17% 증가한다.",
      },
    ],
  },
  tips: {
    summary:
      "주 포지션은 서포터 겸 서브 딜러. 동시에 수행할 수 있다.\n특성은 원소 전투 -> 원소 폭발 -> 기본 공격 순인데, 기본 공격은 필요 없다면 안 해줘도 된다.\n전투 스킬은 바닥에 바위꽃을 피운다. 꽃 주변 범위에서 적에게 피해를 주면 <em>찰나의 꽃</em> 효과로 방어력 기반 추가 피해를 준다. 어떤 피해든 숫자가 뜨면 발동 가능하다. 반대로 적이 보호막, 방패, 껍데기 등으로 보호되거나, 슬라임 처럼 대미지가 들어가지 않으면 발동하지 않는다. 효과는 2초마다 한 번 발동하는데, 적마다 한 번이 아닌 범위(꽃) 내에서 한 번이다. 이 효과의 쿨타임은 꽃을 다시 깔면 초기화된다.\n원소 폭발은 <em>태양꽃</em>이 있을 때에는 7개의 <em>생멸의 꽃</em>을 터뜨려 피해를 준다. 즉, 7번의 바위 피해를 준다. <em>태양꽃</em>이 없다면, <em>생멸의 꽃</em>을 터뜨리지 못하고 버스트 피해만 준다. <em>생멸의 꽃</em>은 범위 내에서 무작위로 터지는데, 발동하면서 평타같은 걸로 적을 때리게 되면 그 적에게 몰리는 경향이 있다. 돌파 특성을 올리면 원소 마스터리 버프를 받을 수 있어, 불 딜러 같은 증폭 반응 딜러에게도 좋다. 필요 원소 에너지도 40으로 매우 낮아 빨리 돈다. 다만 피해량은 공격력 비례라, 방어력 세팅을 하는 <em>알베도</em> 특성상 세팅에 불편함이 있다.\n별자리는 2, 6번째 별자리가 좋은데, 명함으로도 좋다. 1 번째 별자리는 애초에 원소 에너지가 낮아 빨리 돌아 영향력이 적다. 2 번째 별자리는 <em>찰나의 꽃</em>이 터질 때마다 <em>생멸 카운트</em>라는 스택을 쌓는다. 이 스택이 쌓일 때마다 원소 폭발의 피해량이 방어력에 비례해 추가로 상승한다. 4 번째 별자리는 현재로선 <em>소</em> 조합이 아니면 의미가 없다. 6 번째 별자리는 결정을 먹고 보호막을 얻으면 피해량이 증가하는데, 보탬은 되지만 계수가 큰 느낌은 아니다.\n<em>태양꽃</em>을 깔고 원소 폭발을 사용하는 사이클을 사용할 수 있지만, <em>태양꽃</em>은 바위 창조물이라 보스급 몬스터가 밟으면 깨져서 깔 때 신경써줘야 한다.",
    weapons: [
      {
        name: "반암결록",
        content:
          "높은 수준의 치명타 확률을 제공해 세팅에 이점이 있다. 다만, 체력관련 버프는 딱히 쓸모가 없어서 가성비가 떨어진다는 의견도 있다.",
      },
      {
        name: "진사의 방추",
        content:
          "이벤트 「눈보라 속 그림자」에서 얻을 수 있는 알베도 전용무기. 추가 능력치가 방어력인데다, 방어력 비례 원소 전투 피해량 버프까지 받을 수 있다.",
      },
      {
        name: "페보니우스 검",
        content:
          "서포터가 활용하기 좋은 무기. 원소 구슬을 발생시켜 캐릭터의 원소 충전에 도움을 줄 수 있다. 참고로 원소 구슬을 먹은 캐릭터에게 원소 에너지를 채워준다.",
      },
      {
        name: "부식의 검",
        content:
          "이벤트 「백악과 흑룡」에서 얻을 수 있는 무기. 추가 능력치로 원소 충전 효율을 주고, 옵션으로 원소 전투 스킬의 피해량과 치명타 확률을 보정해준다. 원소 폭발엔 도움이 없는 것이 단점.\n다른 서포터 계열 캐릭터들에게 두루 좋아, <em>알베도</em>에겐 다른 걸 주는 경우가 많다.",
      },
      {
        name: "여명신검",
        content:
          "추가 능력치로 치명타 피해량, 옵션으로 치명타 확률을 크게 채워준다. 치명타 확률 버프는 HP가 90%가 넘어야 한다는 조건이 있는데, <em>알베도</em>는 결정을 이용한 보호막이 있어 나름 쓸만하다.",
      },
    ],
    artifacts: {
      recommand: {
        watch: "방어력%",
        grail: "바위 원소 피해량, 방어력%",
        crown: "치명타 확률, 치명타 피해, 방어력%",
        sub_effect: "치명타 확률, 치명타 피해, 방어력%",
      },
      artifact_list: [
        {
          name: ["풍요로운 꿈의 껍데기"],
          content:
            "2셋 효과는 방어력 30%, 4셋 효과는 바위 원소 명중 시 스택을 쌓고, 스택 당 방어력 5% + 바위 원소 피해 6% 버프를 받을 수 있다. 서브 딜러인 <em>알베도</em>에게 잘 어울린다.",
        },
        {
          name: ["유구한 반암"],
          content:
            "4셋 효과로 결정을 먹으면 원소 피해 보너스를 얻을 수 있는데, <em>태양꽃</em>과 <em>찰나의 꽃</em>이 꾸준히 결정을 만들어줘 4셋 효과를 활용해볼 수 있다.",
        },
        {
          name: ["유구한 반암", "풍요로운 꿈의 껍데기"],
          content:
            "원소 전투 스킬을 극대화한 세팅. 별자리 2 번 돌파 시 효과가 더 좋아진다. <em>껍데기</em> 셋이 없었을 땐 4성 성유물인 <em>수호자의 마음</em>을 넣었다.",
        },
        {
          name: ["유구한 반암", "옛 왕실의 의식"],
          content:
            "<em>반암</em> 2셋으로 바위 원소 피해, <em>왕실</em> 2셋으로 원소 폭발 피해 버프를 받는다. <em>반암</em> 2 / <em>껍데기</em> 2과는 달리, 원소 폭발에 초점을 둔 세팅.",
        },
      ],
    },
    partners: [
      {
        name: ["Arataki Itto", "Noelle"],
        content:
          "원소 반응을 활용하지 않는 바위 메인 딜러들은 <em>고로</em>를 활용하게 되는데, 이때 <em>고로</em>의 효과를 받기 위해선 바위 캐릭터 3명을 조합해야 한다. 이때 서포터 포지션으로 <em>알베도</em>를 넣을 수 있다.\n같은 방어력 기반 서포터인 <em>고로</em>와의 상성도 좋고, 파티 내 바위 캐릭터에게 바위 입자를 만들어줘 원소 충전에 도움도 줄 수 있다. 다만, 조합 자체가 원소 반응을 사용하지 않기 때문에 인기가 많지 않은 편이다.",
      },
      {
        name: ["Navia"],
        content:
          "<em>나비아</em>는 결정 반응을 활용하는 메인 딜러인데, <em>알베도</em>는 <em>태양꽃</em>을 이용해 결정을 만들기 쉬워 좋은 시너지를 갖게 된다.",
      },
      {
        name: ["Gorou"],
        content:
          "<em>고로</em>는 바위 캐릭터가 많을수록 버프가 강해지는 특성이 있다. 특히 방어력 버프를 줄 수 있는데, 방어력 기반의 특성을 가진 캐릭터와 시너지가 매우 좋다. <em>알베도</em>역시 마찬가지.",
      },
      {
        name: ["Hutao", "Xingqiu", "Zhongli"],
        content:
          "일명 '호행종알'. <em>호두</em>에겐 바위 공명의 효과가 나름 어울리는데, <em>알베도</em>는 원소 마스터리 버프도 줄 수 있어, <em>호두</em>에게 잘 어울렸다.\n다만, <em>야란</em>의 등장과 동시에 물 공명의 효과가 HP 증가로 바뀌었는데, 이로인해 <em>알베도</em> 대신 물 공명을 위한 물 서브 딜러를 넣게 되면서 조합의 수명이 다하게 된다.",
      },
    ],
  },
};

export default ganyu_detail;
