const version_information: Array<Array<string>> = [
  ["1.0", "개시"],
  [
    "1.1.0",
    "정렬 버튼 추가",
    "안내 버튼 및 내용 추가",
    "기본 정렬 방식 변경 (출시순)",
  ],
  [
    "1.1.1",
    "안내창 닫기 버튼 색 변경 (흰색)",
    "정렬 버튼 알고리즘 수정",
    "안내 내용 일부 수정",
  ],
  [
    "1.1.2",
    "안내 내용 일부 수정",
    "안내 버튼 크기 수정 : 확장",
    "안내 닫기 버튼 크기 수정 : 확장",
  ],
  [
    "1.2.0",
    "야란 추가",
    "쿠키 시노부 카드 추가 (조합 미포함)",
    "스크롤 디자인 수정",
  ],
  [
    "2.0.0",
    "캐릭터 설명 페이지 추가 (타이나리, 사이노, 닐루, 나히다, 콜레이, 도리, 캔디스, 레일라는 추후 추가)",
    "타이나리, 사이노, 닐루, 나히다, 콜레이, 도리, 캔디스, 레일라 카드 추가 (조합 미포함)",
    "시노부 조합 추가",
  ],
  [
    "2.1.1",
    "타이나리 설명 페이지 추가",
    "방랑자, 파루잔 카드 추가 (조합 미포함)",
    "돌파 재료 프레임 수정",
    "대사·패시브 특성 배치 오류 수정",
  ],
  ["2.2.0", "정렬 버튼 추가 : 무기순", "타이나리, 사이노, 닐루 설명/조합 추가"],
  ["2.3.0", "나히다, 방랑자 설명/조합 추가"],
  [
    "2.4.1",
    "콜레이, 도리, 캔디스, 레일라, 파루잔 설명 추가",
    "설명 페이지 드래그/메뉴 스타일 변경",
    "메인 페이지 초기화 버튼 알고리즘 수정",
  ],
  ["2.4.2", "선택 알고리즘 수정", "메인 페이지 안내 내용 일부 수정"],
  ["3.0.0", "라이브러리 수정 : React.js"],
];

export default version_information;
